#********************************************************************
#
#      Copyright (c) 2007 HHIC, ALL RIGHTS RESERVED
#
#********************************************************************
#
#      FILENAME:      drcCnst.tcl
#
#      DESCRIPTION:
#         This script is used to define drc constraints in SYN flow
#
#      REVISION:      initial version by juxiaobo 2007/08/15
#
#--------------------------------------------------------------

set_max_transition 1.2 $topModuleName
 
set_max_fanout 16 $topModuleName
 
#set_max_capacitance 0.5 $topModuleName

